application/backend/controllers/ConfigController.php

SELECT * FROM `prk_config` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Config::findOne($id)) !== null) {