application/backend/controllers/FilesController.php

SELECT * FROM `prk_upload_file` WHERE `id`='100'
---
    protected function findModel($id)
    {
        if (($model = UploadFile::findOne($id)) !== null) {