application/backend/controllers/OrderController.php

SELECT `a`.* FROM `prk_order` `a` LEFT JOIN `prk_order_goods` ON `a`.`id` = `prk_order_goods`.`order_id` LEFT JOIN `prk_order_address` ON `a`.`id` = `prk_order_address`.`order_id` WHERE a.id='3'
---
    public function actionView($id){
        $this->layout = '_main';
        $model = Order::find()
            ->alias('a')
            ->where("a.id=:id")
            ->addParams([':id'=>$id])
            ->joinWith('goods')
            ->joinWith('address')
            ->one();