application/backend/controllers/PromSeckillController.php

SELECT * FROM `prk_goods` WHERE id=1
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        $model->scenario = 'update';
        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['index']);
        } else {
            $goods = Goods::find()
                ->where("id=:id")
                ->addParams([':id'=>$model->goods_id])
                ->one();

SELECT * FROM `prk_prom_seckill` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = PromSeckill::findOne($id)) !== null) {