application/backend/controllers/WxController.php

SELECT * FROM `prk_config` WHERE keyid='weixin'
---
    public function actionMiniConfig(){
        $keyid = 'mini';
        $model = Config::find()->where('keyid=:keyid')->addParams([':keyid'=>'weixin'])->one();