application/backend/controllers/WxReplyController.php

    protected function findModel($id)
    {
        if (($model = WxReply::findOne($id)) !== null) {
---
SELECT * FROM `prk_wx_reply` WHERE `id`='4'