common/models/GoodsAttrValue.php

SELECT `value`, `attr_id`, `id` FROM `prk_goods_attr_value` WHERE id=1
---
    public static function findModelData($id){
        $id = (int)$id;
        if(empty($id)){
            return '';
        }
        static $list;
        $cache_key = self::CACHE_KEY_FIND_MODEL_DATA;

        /* 获取缓存数据 */
        if(empty($list)){
            $list = Yii::$app->cache->get($cache_key);
        }
        $key = $id;
        if(isset($list[$key])){ //已缓存，直接使用
            $data = $list[$key];
        } else {
            $model = self::find()
                ->where("id=:id")
                ->addParams([':id' => $id])
                ->select('value,attr_id,id')
                ->asArray()
                ->one();