common/models/GoodsAttr.php

    public static function findModelText($id){
        $id = (int)$id;
        if(empty($id)){
            return '';
        }
        static $list;
        $cache_key = self::CACHE_KEY_FIND_MODEL_TEXT;

        /* 获取缓存数据 */
        if(empty($list)){
            $list = Yii::$app->cache->get($cache_key);
        }
        $key = $id;
        if(isset($list[$key])){ //已缓存，直接使用
            $name = $list[$key];
        } else {
            $model = self::find()
                ->where("id=:id")
                ->addParams([':id' => $id])
                ->select('name')
                ->asArray()
                ->one();
---
SELECT `name` FROM `prk_goods_attr` WHERE id=1