common/models/Region.php

SELECT `id`, `name` FROM `prk_region`
---
    public static function getRegionAll(){
        $data = Yii::$app->cache->get(self::CACHE_KEY_FIND_MODEL);
        if($data === false){
        $data = self::find()
            ->select("id,name")
            ->asArray()
            ->all();