application/backend/models/GoodsSku.php

SELECT `id`, `sku_attr_id`, `image_id`, `stock`, `price`, `orig_price`, `productcode`, `goods_weight` FROM `prk_goods_sku` WHERE goods_id=1 and sku_attr_id<>'' ORDER BY `updated_at`, `id`
---
    public static function getSkuList($goods_id){

        $volist = self::find()
            ->where("goods_id=:goods_id and sku_attr_id<>''")
            ->addParams([':goods_id'=>$goods_id])
            ->select("id,sku_attr_id,image_id,stock,price,orig_price,productcode,goods_weight")
            ->orderBy(['updated_at'=>SORT_ASC,'id'=>SORT_ASC])
            ->asArray()
            ->all();