application/backend/models/SystemLog.php

    public static function log($name,$remark='浏览数据'){
        if(Yii::$app->user->isGuest){
            return false;
        }
        $log                    =   array();
        if(empty($post)){
            $log['POST']        =   $_POST;
            unset($log['POST'][Yii::$app->request->csrfParam]);
        }
        if(empty($get)) {
            $log['GET']         = $_GET;
        }
        $user = Yii::$app->user->identity;
        $model = new SystemLog();
        $model->uid             = $user->id;
        $model->username        = $user->username;
        $model->realname        = $user->realname;
        $model->action_url      = Yii::$app->request->url;

        $model->action_name     = $name;
        $model->action_remark   = $remark;
        $model->action_log      = json_encode($log);;
        if($model->validate()){
            return $model->save();
---
INSERT INTO `prk_system_log` (`uid`, `username`, `realname`, `action_url`, `action_name`, `action_remark`, `action_log`, `action_ip`, `created_at`) VALUES (1, 'thinkbinny', '黄先生', '/admin/wx-reply/status.shtml', '未知', '编辑数据', '{\"POST\":{\"id\":\"4\",\"name\":\"status\",\"value\":\"0\"},\"GET\":[]}', '2130706433', 1593838837)