application/backend/models/WxReplyKey.php

    public static function removeKey($key){
        if(empty($key)) return ;
        foreach ($key as $name){
            $model = WxReplyKey::find()->where(['name'=>$name])->one();
            if(!empty($model)){
                $model->delete();
---
SELECT * FROM `prk_wx_reply_key` WHERE `name`='英文'
DELETE FROM `prk_wx_reply_key` WHERE `id`=2

    public static function getFinds($wx_reply_id){
        $volist = WxReplyKey::find()
            ->where(['wx_reply_id'=>$wx_reply_id])
            ->select('name')
            ->asArray()
            ->all();
---
SELECT `name` FROM `prk_wx_reply_key` WHERE `wx_reply_id`=4